export const tipsMap = new Map<any, any>([
  [
    '特大城市',
    {
      tips: '2014年10月29日,国务院发布《关于调整城市规模划分标准的通知》，根据城市规模划分类型，将城区常住人口500万以上1000万以下的城市划分为特大城市。',
      link: 'https://www.gov.cn/zhengce/content/2014-11/20/content_9225.htm',
    },
  ],
  [
    '超大城市',
    {
      tips: '2014年10月29日,国务院发布《关于调整城市规模划分标准的通知》，根据城市规模划分类型，将城区常住人口1000万以上的城市划分为超大城市。',
      link: 'https://www.gov.cn/zhengce/content/2014-11/20/content_9225.htm',
    },
  ],
  [
    '京津冀城市群',
    {
      tips: '2015年4月30日，中共中央政治局审议通过《京津冀协同发展规划纲要》，推动京津冀协同发展。',
      link: 'W020200811119417541237.doc (live.com)',
    },
  ],
  [
    '长江三角洲城市群',
    {
      tips: '2019年12月1日，中共中央、国务院印发了《长江三角洲区域一体化发展规划纲要》，推动长三角一体化发展，增强长三角地区创新能力和竞争能力，提高经济集聚度、区域连接性和政策协同效率。',
      link: '中共中央 国务院印发《长江三角洲区域一体化发展规划纲要》_中央有关文件_中国政府网 (www.gov.cn)',
    },
  ],
  [
    '珠三角城市群',
    {
      tips: '2011年6月7日，国务院发布《珠江三角洲地区改革发展规划纲要》，为促进珠江三角洲地区创新优势，更上一层楼，进一步发挥对全国的辐射带动作用和先行示范作用。',
      link: '珠江三角洲地区改革发展规划纲要(2008-2020) (scio.gov.cn)',
    },
  ],
  [
    '泛珠三角区域',
    {
      tips: '2016年3月15日，国务院发布关于深化泛珠三角区域合作的指导意见，提出深化泛珠三角区域合作，构建经济繁荣、社会和谐、生态良好的泛珠三角区域。',
      link: '国务院关于深化泛珠三角区域合作的指导意见（国发〔2016〕18号）_政府信息公开专栏 (www.gov.cn)',
    },
  ],
  [
    '粤港澳大湾区',
    {
      tips: '2019年4月10日，中共中央、国务院印发《粤港澳大湾区发展规划纲要》，深化内地与港澳合作，进一步提升粤港澳大湾区在国家经济发展和对外开放中的支撑引领作用。',
      link: '中共中央 国务院印发《粤港澳大湾区发展规划纲要》 (mofcom.gov.cn)',
    },
  ],
  [
    '成渝城市群',
    {
      tips: '2021年10月21日，中共中央、国务院印发了《成渝地区双城经济圈建设规划纲要》，作出推动成渝地区双城经济圈建设、打造高质量发展重要增长。',
      link: '中共中央 国务院印发《成渝地区双城经济圈建设规划纲要》_中央有关文件_中国政府网 (www.gov.cn)',
    },
  ],
  [
    '长江中游城市群',
    {
      tips: '2022年2月15日，国家发展改革委印发《长江中游城市群发展“十四五”实施方案》，推动长江经济带发展、促进中部地区崛起、巩固“两横三纵”城镇化战略格局。',
      link: '国家发展改革委关于印发长江中游城市群发展“十四五”实施方案的通知_宏观经济_中国政府网 (www.gov.cn)',
    },
  ],
  [
    '粤闽浙沿海城市群',
    {
      tips: "2021年3月13日，两会通过'十四五规划',构建多个中心城市和都市圈构成的粤闽浙沿海城市群，推动地区协调发展。",
      link: '重磅规划出台！粤闽浙沿海城市群诞生！泉州迎来国家级发展..._晋江 (sohu.com)',
    },
  ],
  [
    '北部湾城市群',
    {
      tips: '2022年3月25日，国家发展改革委印发《北部湾城市群建设“十四五”实施方案》，加快构建新发展格局，全面深化改革开放，坚持创新驱动发展，推动高质量发展。',
      link: '国家发展改革委关于印发北部湾城市群建设“十四五”实施方案的通知_宏观经济_中国政府网 (www.gov.cn)',
    },
  ],
  [
    '关中平原城市群',
    {
      tips: '2022年6月24日，国家发展改革委印发《关中平原城市群发展规划》，培育建设关中平原城市群，要立足西北，着眼全国，以开放促发展，以创新求跨越，以文化塑标识，加快提升辐射带动能力，全面实现追赶超越。',
      link: '【关于印发关中平原城市群发展规划的通知(发改规划〔2018〕220号)】-国家发展和改革委员会 (ndrc.gov.cn)',
    },
  ],
  [
    '中原城市群',
    {
      tips: '2017年1月5日，国家发展改革委印发《中原城市群发展规划》，把中原城市群建设成为经济发展新增长极、重要的先进制造业和现代服务业基地等，构建网络化、开放式、一体化的发展新格局。',
      link: '发展改革委关于印发中原城市群发展规划的通知_国务院部门政务联播_中国政府网 (www.gov.cn)',
    },
  ],
  [
    '山东半岛城市群',
    {
      tips: '2017年3月20日，山东省人民政府批复《山东半岛城市群发展规划（2016－2030年）》，牢固树立创新、协调、绿色、开放、共享的发展理念，构建网络化、开放式、一体化的山东半岛城市群发展新格局。',
      link: '山东省人民政府 公报汇总 山东省人民政府关于山东半岛城市群发展规划（2016-2030年）的批复 (shandong.gov.cn)',
    },
  ],
  [
    '呼包鄂榆城市群',
    {
      tips: '2018年2月27日，国家发展改革委印发《呼包鄂榆城市群发展规划》，强化改革开放引领作用，彰显区域民族特色，充分发挥各城市比较优势，促进城市群内部协同发展和城市群整体对外开放。',
      link: '国家发展改革委关于印发呼包鄂榆城市群发展规划的通知_城市规划_中国政府网 (www.gov.cn)',
    },
  ],
  [
    '兰西城市群',
    {
      tips: '2018年3月13日，国家发展改革委印发《兰州—西宁城市群发展规划》，着眼国家安全，立足西北内陆，面向中亚西亚，把兰州—西宁城市群培育发展成为支撑国土安全和生态安全格局、维护西北地区繁荣稳定的重要城市群。',
      link: '【关于印发兰州—西宁城市群发展规划的通知(发改规划〔2018〕423号)】-国家发展和改革委员会 (ndrc.gov.cn)',
    },
  ],
  [
    '哈长城市群',
    {
      tips: '2020年1月3日，国家发展改革委印发《哈长一体化发展示范区实施方案》建立哈长一体化发展示范区，在统一规划编制、基础设施共建、公共服务共享、体制机制协同等方面进行探索和试点。',
      link: '黑龙江省发展和改革委员会、吉林省发展和改革委员会关于印发《哈长一体化发展示范区实施方案》的通知 (jl.gov.cn)',
    },
  ],
  [
    '辽中南城市群',
    {
      tips: '辽中南城市群以沈阳、大连为中心，包括鞍山、抚顺、本溪、丹东、辽阳、营口、盘锦等城市。辽中南城市群将优化空间布局，利用岸线资源，加快发展速度，提高发展质量。',
      link: '科学智库--辽中南城市群 (sciencereading.cn)',
    },
  ],
  [
    '山西中部城市群',
    {
      tips: '2022年10月31日，山西省人民政府印发《山西中部城市群高质量发展规划（2022—2035年）》，着眼山西、对标一流，充分发挥五市比较优势，强化跨区域协作，推动要素自由流动，引领带动全省高质量发展。',
      link: '山西省人民政府办公厅关于印发山西中部城市群高质量发展规划（2022—2035年）的通知_高平市人民政府网 (sxgp.gov.cn)',
    },
  ],
  [
    '宁夏沿黄城市群',
    {
      tips: '2021年9月7日，宁夏自治区人民政府印发《宁夏回族自治区新型城镇化“十四五”规划》，立足宁夏实际、遵循客观规律，因势利导、顺势而为，坚持走中国特色新型城镇化道路，到2035年基本实现新型城镇化。',
      link: '自治区人民政府办公厅关于印发宁夏回族自治区新型城镇化“十四五”规划的通知- 宁夏 (nx.gov.cn)',
    },
  ],
  [
    '黔中城市群',
    {
      tips: '2017年3月1日，国家发展改革委印发《黔中城市群发展规划》，充分发挥区域比较优势，优化要素资源空间配置，加强城镇分工协作，走出一条具有西部地区特色、符合贵州省情的城市群发展新路。',
      link: '目 录 (qiannan.gov.cn)',
    },
  ],
  [
    '天山北坡城市群',
    {
      tips: '2017年10月，国家发改委印发《天山北坡城市群发展规划（2017-2030）》，提出将天山北坡城市群建成丝绸之路经济带重要的战略枢纽，构建边疆城市群一体化发展的开放格局。',
      link: '天山北坡城市群发展规划 - 中国工程科技知识中心 (ckcest.cn)',
    },
  ],
  [
    '滇中城市群',
    {
      tips: '2020年8月28日，云南省政府印发《滇中城市群发展规划》，发挥区位优势，引领云南现代化建设，构筑生态文明建设新支撑，推进民族团结进步新发展，构建改革开放新格局，建设面向南亚东南亚开放的门户城市群。',
      link: '云南省政府发布《滇中城市群发展规划》_地方政务_中国政府网 (www.gov.cn)',
    },
  ],
  [
    '沈阳都市圈',
    {
      tips: '2022年7月，沈阳市人民政府完成《沈阳现代化都市圈发展规划》编制，推进基础设施、产业协作、要素市场、公共服务、生态环保等项目进程，共同推动都市圈建设取得新跨越新突破。',
      link: 'http://www.shenyang.gov.cn/zt/zxxtp/gzdt/202207/t20220716_3414207.html',
    },
  ],
  [
    '长春都市圈',
    {
      tips: '2020年1月16日，政府提出长春现代化都市圈从区域协调、生态环保、资源能源、基础设施、综合交通、产业发展等多个角度，强化城市资源整合和跨区域产业协作，构建核心引领、梯次推进、协调联动的发展新格局。',
      link: '长春打造东北振兴增长极建设现代化都市圈(changchun.gov.cn)',
    },
  ],
  [
    '首都都市圈',
    {
      tips: '2010年8月，国家发改委上报国务院《京津冀都市圈区域规划》,推动京津冀地区经济、社会和环境的协调发展。',
      link: 'http://www.beijing.gov.cn/gongkai/shuju/sjjd/202202/t20220224_2615498.html',
    },
  ],
  [
    '太原都市圈',
    {
      tips: '2017年1月26日，山西省人民政府编制《太原都市圈规划（2011～2030）》，将太原都市区发展成为国家能源服务及创新中心，全国重要先进制造业基地和文化旅游基地，太原都市圈新型城镇化的核心主体和引领中心。',
      link: 'http://www.shanxi.gov.cn/zfxxgk/zfxxgkzl/fdzdgknr/ghxx/202005/t20200520_5989243.shtml',
    },
  ],
  [
    '上海大都市圈',
    {
      tips: '2022年09月28日，上海市、江苏省、浙江省人民政府联合编制并印发了《上海大都市圈空间协同规划》，推动上海大都市圈和长三角一体化协调发展。',
      link: '《上海大都市圈空间协同规划》公开发布(ningbo.gov.cn)',
    },
  ],
  [
    '南京都市圈',
    {
      tips: '2022年2月28日，江苏省、安徽省人民政府印发《南京都市圈发展规划》，立足新发展阶段，贯彻新发展理念，构建新发展格局，以推动高质量发展为主题，以提升都市圈整体实力和竞争力。',
      link: '【江苏省人民政府安徽省人民政府关于印发南京都市圈发展规划的通知】-国家发展和改革委员会(ndrc.gov.cn)',
    },
  ],
  [
    '杭州都市圈',
    {
      tips: '2016年6月1日，国家发改委印发《长江三角洲城市群发展规划》，指出杭州都市圈促进包括杭州、嘉兴、湖州、绍兴四市，发挥创业创新优势，培育发展信息经济等新业态新引擎。',
      link: 'https://www.ndrc.gov.cn/xxgk/zcfb/ghwb/201606/t20160603_962187.html',
    },
  ],
  [
    '宁波都市圈',
    {
      tips: '2016年6月1日，国家发改委印发《长江三角洲城市群发展规划》，指出宁波都市圈包括宁波、舟山、台州三市。高起点建设浙江舟山群岛新区和江海联运服务中心、台州小微企业金融服务改革创新试验区。',
      link: 'https://www.ndrc.gov.cn/xxgk/zcfb/ghwb/201606/t20160603_962187.html',
    },
  ],
  [
    '苏锡常都市圈',
    {
      tips: '2016年6月1日，国家发改委印发《长江三角洲城市群发展规划》，指出苏锡常都市圈。包括苏州、无锡、常州三市。全面强化与上海的功能对接与互动，加快推进沪苏通、锡常泰跨江融合发展。',
      link: 'https://www.ndrc.gov.cn/xxgk/zcfb/ghwb/201606/t20160603_962187.html',
    },
  ],
  [
    '徐州都市圈',
    {
      tips: '2021年4月13日，徐州市人民政府印发《徐州市国民经济和社会发展第十四个五年规划和2035年远景目标纲要》，指出推动徐州都市圈同城化发展。',
      link: 'https://www.xz.gov.cn/govxxgk/014051247/2021-04-19/1363d58f-2618-4fe4-82cb-3df5becf668e.html',
    },
  ],
  [
    '合肥都市圈',
    {
      tips: '2016年6月1日，国家发改委印发《长江三角洲城市群发展规划》，指出合肥都市圈包括合肥、芜湖、马鞍山三市。发挥承东启西的区位优势和创新资源富集优势，提升合肥辐射带动功能，打造区域增长新引擎。',
      link: 'https://www.ndrc.gov.cn/xxgk/zcfb/ghwb/201606/t20160603_962187.html',
    },
  ],
  [
    '大南昌都市圈',
    {
      tips: '2019年7月11日，江西省人民政府印发《大南昌都市圈发展规划（2019-2025年）》，加快构建核心引领、功能清晰、分工合理、网络联动、融合一体的大南昌都市圈发展格局。',
      link: '江西省人民政府规划计划江西省人民政府关于印发大南昌都市圈发展规划（2019-2025年）的通知(jiangxi.gov.cn)',
    },
  ],
  [
    '济南都市圈',
    {
      tips: '2022年07月15日，济南市人民政府印发《济南市新型城镇化规划（2021-2035年）》，提出以济南为中心，辐射带动淄博、泰安、聊城、德州、滨州、东营六市一体发展、协同发展、融合发展。',
      link: 'http://www.jinan.gov.cn/art/2022/7/15/art_114311_4943746.html',
    },
  ],
  [
    '青岛都市圈',
    {
      tips: '2021年12年31日，山东省人民政府印发《山东半岛城市群发展规划》，提出青岛都市圈由青岛、潍坊2市和烟台市莱阳市、海阳市构成，促进其成为东北亚地区国家合作枢纽之一，全省发展核心引擎。',
      link: 'http://www.shandong.gov.cn/art/2022/1/6/art_107851_116579.html',
    },
  ],
  [
    '厦漳泉都市圈',
    {
      tips: '厦漳泉都市圈的发展规划指出，厦漳泉都市圈包括厦门、漳州、泉州三市，旨在进一步推动三市的协同发展，提升整体竞争力，实现更高质量的经济增长。',
      link: 'https://www.toutiao.com/article/7306885627621442100/',
    },
  ],
  [
    '福州都市圈',
    {
      tips: '2021年7月9日，山东省人民政府印发《福州都市圈发展规划》以基础设施、产业与创新、公共服务、生态环保等领域协同为重点，实现共建共治共享、同城化同家园，为全方位推进高质量发展超越提供有力支撑。',
      link: '福建省人民政府关于印发福州都市圈发展规划的通知_省政府文件_福建省人民政府门户网站(fujian.gov.cn)',
    },
  ],
  [
    '武汉都市圈',
    {
      tips: '2016年6月1日，国家发改委印发《长江三角洲城市群发展规划》，全面加快武汉城市圈一体化建设，推进武汉与鄂州、孝感、咸宁、黄冈、黄石等同城化发展。',
      link: 'https://www.ndrc.gov.cn/xxgk/zcfb/ghwb/201606/t20160603_962187.html',
    },
  ],
  [
    '郑州都市圈',
    {
      tips: '2019年4月，《郑州大都市区空间规划（2018-2035年）》指出，推动郑州与开封、新乡、焦作、许昌四市深度融合，建设现代化大都市区，形成带动周边、辐射全国、联通国际的核心区域。',
      link: 'https://www.henanrd.gov.cn/2019/04-30/9348.html',
    },
  ],
  [
    '洛阳都市圈',
    {
      tips: '2020年12月28日，政府发布《洛阳都市圈发展规划（2020—2035）》，提出规划建设洛阳都市圈，推动洛阳、平顶山、焦作、三门峡、济源一体化发展。',
      link: 'http://www.changyuan.gov.cn/sitesources/cyxrmzf/page_pc/ywdt/szfxx/articleeb9e495a2ec743d78261d2624ef9ea38.html',
    },
  ],
  [
    '长株潭都市圈',
    {
      tips: '2022年3月22日，湖南省人民政府印发《长株潭都市圈发展规划》，统筹推进长株潭“五位一体”建设，发挥长沙市辐射带动周边城镇联动发展作用，推动地区协调发展。',
      link: '湖南省人民政府关于印发《长株潭都市圈发展规划》的通知-湖南省人民政府门户网站(hunan.gov.cn)',
    },
  ],
  [
    '南宁都市圈',
    {
      tips: '2021年6月3日， 南宁市人民政府印发《南宁市国民经济和社会发展第十四个五年规划和2035年远景目标纲要》，优化国土空间布局，高标准建设南宁都市圈。',
      link: 'https://fgw.nanning.gov.cn/fggz/fzgh/t4764280.html',
    },
  ],
  [
    '广州都市圈',
    {
      tips: '2020年6月12日，广东省发展改革委印发《广东省开发区总体发展规划（2020-2035年）》，指出广州都市圈（包括广州、佛山、肇庆、清远、云浮和韶关）深度融合，协调发展。',
      link: 'http://www.sz.gov.cn/cn/xxgk/zfxxgj/zwdt/content/post_7784925.html',
    },
  ],
  [
    '深圳都市圈',
    {
      tips: '2020年6月12日，广东省发展改革委印发《广东省开发区总体发展规划（2020-2035年）》，指出深圳都市圈（包括深圳、东莞、惠州、河源和汕尾）深度融合，协调发展。',
      link: 'http://www.sz.gov.cn/cn/xxgk/zfxxgj/zwdt/content/post_7784925.html',
    },
  ],
  [
    '珠江口西岸都市圈',
    {
      tips: '2020年6月12日，广东省发展改革委印发《广东省开发区总体发展规划（2020-2035年）》，指出珠江口西岸都市圈（包括珠海、中山、江门和阳江）深度融合，协调发展。',
      link: 'http://www.sz.gov.cn/cn/xxgk/zfxxgj/zwdt/content/post_7784925.html',
    },
  ],
  [
    '成都都市圈',
    {
      tips: '2021年11月29日，四川省人民政府印发《成都都市圈发展规划》，聚焦构建双城引领、双圈互动、两翼协同的成渝地区双城经济圈发展新格局，做优成渝地区双城经济圈重要极核。',
      link: '四川省人民政府关于印发《成都都市圈发展规划》的通知(sc.gov.cn)',
    },
  ],
  [
    '重庆都市圈',
    {
      tips: '2022年8月22日，重庆市人民政府印发《重庆都市圈发展规划》，以改革创新为根本动力，以促进中心城区和周边城市（镇）同城化为主攻方向，建设经济发达、生活富裕、环境优美、社会和谐的现代化重庆都市圈。',
      link: 'http://www.cq.gov.cn/zwgk/zfxxgkml/szfwj/qtgw/202208/t20220822_11028677.html',
    },
  ],
  [
    '西安都市圈',
    {
      tips: '2022年3月25日，陕西省人民政府印发《西安都市圈发展规划》，发挥西安国家中心城市辐射作用，更好带动周边城镇联动发展，加快建设具有全国影响力和历史文化魅力的现代化都市圈。',
      link: 'http://www.shaanxi.gov.cn/zfxxgk/fdzdgknr/zcwj/nszfwj/szf/202208/t20220808_2238133.html',
    },
  ],
]);

export const formateTag = (area: string) => {
  switch (area) {
    case '北京市':
    case '天津市':
    case '重庆市':
    case '上海市':
      return '直辖市';
    case '广州市':
    case '南京市':
    case '武汉市':
    case '沈阳市':
    case '西安市':
    case '成都市':
    case '济南市':
    case '杭州市':
    case '哈尔滨市':
    case '长春市':
      return '副省级市';
    case '大连市':
    case '青岛市':
    case '宁波市':
    case '厦门市':
    case '深圳市':
      return '副省级市/计划单列市';
    default:
      return '';
  }
};

export const TRANCE_AREA = ['超大城市', '特大城市'];
