// 展示指标列表
const IndexList = [
  {
    name: '经济',
    child: [
      { name: 'GDP(亿元)', value: '地区生产总值' },
      { name: 'GDP增速(%)', value: '地区生产总值增速:同比' },
      { name: '人均GDP(元)', value: '人均地区生产总值' },
      { name: '第一产业增加值(亿元)', value: '第一产业' },
      { name: '第二产业增加值(亿元)', value: '第二产业' },
      { name: '第三产业增加值(亿元)', value: '第三产业' },
      { name: '人口(万人)', value: '人口' },
      { name: '工业增加值(亿元)', value: '工业增加值' },
      { name: '工业总产值(亿元)', value: '工业总产值' },
      { name: '固定资产投资(亿元)', value: '固定资产投资' },
      { name: '房地产开发投资(亿元)', value: '房地产投资' },
      { name: '进出口总额(亿美元)', value: '进出口总额' },
      { name: '社会消费品零售总额(亿元)', value: '社会消费品零售总额' },
      { name: ' 城镇居民人均可支配收入(元)', value: '城镇居民人均可支配收入' },
    ],
  },
  {
    name: '财政',
    child: [
      { name: '一般公共预算收入(亿元)', value: '一般公共预算收入' },
      { name: '一般公共预算收入增速(％)', value: '一般公共预算收入:同比' },
      { name: '税收收入(亿元)', value: '税收收入' },
      { name: '转移性收入(亿元)', value: '转移性收入' },
      { name: '上级补助收入(亿元)', value: '一般公共预算收入:上级补助收入' },
      { name: '一般公共预算支出(亿元)', value: '一般公共预算支出' },
      { name: '政府性基金收入(亿元)', value: '政府性基金收入' },
      { name: '土地出让收入(亿元)', value: '土地出让收入' },
      { name: '政府性基金支出(亿元)', value: '政府性基金支出' },
      { name: '国有资本经营收入(亿元)', value: '国有资本经营收入' },
      { name: '国有资本经营支出(亿元)', value: '国有资本经营支出' },
    ],
  },
  {
    name: '债务',
    child: [
      { name: '地方政府债务余额(亿元)', value: '地方政府债务余额' },
      { name: '一般债余额(亿元)', value: '地方政府债务余额:一般债务' },
      { name: '专项债余额(亿元)', value: '地方政府债务余额:专项债务' },
      { name: '地方政府债务限额(亿元)', value: '地方政府债务限额' },
      { name: '城投平台有息债务(亿元)', value: '融资平台有息债务' },
      { name: '财政自给率(%)', value: '财政自给率' },
      { name: '负债率(%)', value: '负债率1' },
      { name: '负债率(宽口径)(%)', value: '负债率2' },
      { name: '债务率(%)', value: '债务率1' },
      { name: '债务率(宽口径)(%)', value: '债务率2' },
    ],
  },
];

export default IndexList;

export type IndexListType = typeof IndexList;
