//长地区名称映射
export const LONG_REGION_NAME_MAP = new Map([
  ['广西壮族自治区', '广西'],
  ['内蒙古自治区', '内蒙古'],
  ['宁夏回族自治区', '宁夏'],
  ['西藏自治区', '西藏'],
  ['新疆维吾尔自治区', '新疆'],
]);

//图表颜色列表
export const chartColorArr = [
  '#3986fe',
  '#f57f50',
  '#f9d237',
  '#35caca',
  '#73e6bf',
  '#4cca72',
  '#f26279',
  '#db80d1',
  '#9d8aee',
  '#529ceb',
  '#965ee3',
  '#f08882',
  '#60c3d2',
  '#edb965',
  '#7d90db',
  '#9cd88a',
  '#31b0f7',
  '#fdb078',
  '#fcc58b',
  '#efd172',
  '#c17cf7',
  '#8bcdf3',
  '#f3b5b7',
  '#2a9c9e',
  '#5fcef5',
  '#f05c80',
  '#6d64f2',
  '#7cbbfe',
  '#91e1da',
  '#54d1ab',
];

//中国地图不可点击的地区,
export const unClickChinaAreaLists = ['台湾', '香港', '澳门', '南海诸岛'];

//省直辖市名称映射
export const provinceNameMap = new Map([
  ['北京市', '北京'],
  ['天津市', '天津'],
  ['河北省', '河北'],
  ['山西省', '山西'],
  ['内蒙古自治区', '内蒙古'],
  ['辽宁省', '辽宁'],
  ['吉林省', '吉林'],
  ['黑龙江省', '黑龙江'],
  ['上海市', '上海'],
  ['江苏省', '江苏'],
  ['浙江省', '浙江'],
  ['安徽省', '安徽'],
  ['福建省', '福建'],
  ['江西省', '江西'],
  ['山东省', '山东'],
  ['河南省', '河南'],
  ['湖北省', '湖北'],
  ['湖南省', '湖南'],
  ['广东省', '广东'],
  ['广西壮族自治区', '广西'],
  ['海南省', '海南'],
  ['重庆市', '重庆'],
  ['四川省', '四川'],
  ['贵州省', '贵州'],
  ['云南省', '云南'],
  ['西藏自治区', '西藏'],
  ['陕西省', '陕西'],
  ['甘肃省', '甘肃'],
  ['青海省', '青海'],
  ['宁夏回族自治区', '宁夏'],
  ['新疆维吾尔自治区', '新疆'],
]);

//计划单列市code，210200:大连；370200:青岛；330200:宁波；350200:厦门；440300：深圳
export const specialCities = ['210200', '370200', '330200', '440300', '350200', '370200'];
